Revit 2024 API
ExternalDataTypeServerFailureResolutionExecutingEventArgs Properties
The ExternalDataTypeServerFailureResolutionExecutingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Document
 The document associated with the event.
 (Inherited from RevitAPIPreDocEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
See Also
ExternalDataTypeServerFailureResolutionExecutingEventArgs Class
Autodesk.Revit.DB.Events Namespace